#_*_coding=cp949
#_*_coding: euc-kr
##비트 연산자
##시프트 연산자

a=100 #'0b0110 0100'
result=0
i=0

for i in range(1,5): #1~4까지 
    result = a << i
    print("%d << %d = %d" % (a,i,result)) # a<<i => a*(2**i) 와 같은 효과
"""
>>>'0b01100100'
100
>>> 0b11001000
200
>>> 0b110010000
400
>>> 0b1100100000
800
>>> 0b11001000000
1600
"""
for i in range(1,5):
    result = a >> i
    print("%d >> %d = %d" % (a,i,result)) # a>>i => int(a/(2**i)) 와 같은 효과
"""
>>> 0b01100100
100
>>> 0b00110010
50
>>> 0b00011001
25
>>> 0b00001100
12
>>> 0b00000110
6
"""


"""
<< 시프트 연산에서 비트크기를 정하여 1이 사라지게 하려면
 (100<<2)&0xFF 처럼 &로 크기를 정해주면 됨
"""
